//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//**********************************************************************
//
// $Header: $
//
// $Revision: $
//
// $Date: $
//
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//
//**********************************************************************

//<AMI_FHDR_START>
//----------------------------------------------------------------------------
//
// Name:            MeSetup.uni
//
// Description:     String for ME Setup.
//
//----------------------------------------------------------------------------
//<AMI_FHDR_END>

//**********************************************************************
//**********************************************************************
/=#

#include "VFR.uni"

#string STR_ME_FORM                             #language eng "PCH-FW Configuration"
#string STR_ME_FORM_HELP                        #language eng "Configure Management Engine Technology Parameters"

#string STR_ME_SUBTITLE                         #language eng "Management Engine Technology Configuration"

//---------------------------------------------------------------------------
// ME Configuration
//---------------------------------------------------------------------------
#string STR_ENABLED                             #language eng "Enabled"
#string STR_DISABLED                            #language eng "Disabled"

#string STR_ME_FW_INFO_HELP                     #language eng  "Multiple SKU selection \nMiniSku:\n ME + MeClock \nFull SKU:\n ME + AMT(whole AMT)+ MeClock + DT\nAuto Selection:\n Which kind of Me Firmware is it at present"
#string STR_ME_FW_INFO_PROMPT                   #language eng  "ME Firmware Mode"
#string STR_ME_FW_INFO_VALUE                    #language eng  "N/A" //dynamically updated  
#string STR_ME_FW_TYPE_HELP                     #language eng  "Tells us whether we have a 4Meg or 8Meg Firmware"
#string STR_ME_FW_TYPE_PROMPT                   #language eng  "ME Firmware Type"   
#string STR_ME_FW_TYPE_NORMAL                   #language eng  "Full Sku Firmware"
#string STR_ME_FW_TYPE_MIN                      #language eng  "Minisku Firmware"                
#string STR_ME_NORMAL_MODE                      #language eng  "Normal Mode"
#string STR_ME_FAILED                           #language eng  "Me Failed"
#string STR_ME_TEMP_DISABLED                    #language eng  "Me Temporarily Disabled"   
#string STR_ME_IGNITION                         #language eng  "Me Ignition"   
#string STR_ME_SECOVER                          #language eng  "Secovr Jmpr/Heci MSG"   
#string STR_ME_ALT_DISABLED                     #language eng  "ME ALT Disabled" 
#string STR_ME_SV_FW                            #language eng  "SV Firmware"   
#string STR_ME_FW_VERSION_HELP                  #language eng  "ME Firmware Version"
#string STR_ME_FW_VERSION_PROMPT                #language eng  "ME FW Version"
#string STR_ME_FW_VERSION_VALUE                 #language eng  "N/A" //dynamically updated                    

#string STR_PTT_CAPABILITY_STATE_HELP           #language eng  "PTT Capability / State"
#string STR_PTT_CAPABILITY_STATE_PROMPT         #language eng  "PTT Capability / State"
#string STR_PTT_CAPABILITY_STATE_VALUE          #language eng  "N/A" //dynamically updated

#string STR_ME_FW_SKU_HELP                      #language eng  "ME Firmware SKU"
#string STR_ME_FW_SKU_PROMPT                    #language eng  "ME Firmware SKU"
#string STR_ME_FW_SKU_VALUE                     #language eng  "N/A" //dynamically updated

#string STR_NFC_SUPPORT_PROMPT                  #language eng  "NFC Support"
#string STR_NFC_SUPPORT_HELP                    #language eng  "NFC Capability State"
#string STR_NFC_SUPPORT_VALUE                   #language eng  "N/A"

#string STR_NFC_STATE_PROMPT                    #language eng  "NFC State"
#string STR_NFC_STATE_HELP                      #language eng  "Enable/Disable NFC Runtime State."
#string STR_MDES_STATUS_PROMPT                  #language eng  "MDES BIOS Status Code"
#string STR_MDES_STATUS_HELP                    #language eng  "Enable/Disable MDES BIOS Status Code."
#string STR_ENABLED_STRING                      #language eng  "Enabled"
#string STR_DISABLED_STRING                     #language eng  "Disabled"

#string STR_FTPMSWITCH_STATUS_PROMPT            #language eng  "fTPM Switch Selection"
#string STR_FTPMSWITCH_STATUS_HELP              #language eng  "Selects the desired fTPM solution to be used."
#string STR_GPDMA_STRING                        #language eng  "GPDMA Work-Around"
#string STR_MSFT_STRING                         #language eng  "MSFT QFE Solution"

#string STR_TPMDEVICE_SELECTION_PROMPT          #language eng  "TPM Device Selection"
#string STR_TPMDEVICE_SELECTION_HELP            #language eng  "Selects TPM device: PTT or dTPM. PTT - Enables PTT in SkuMgr dTPM 1.2 - Disables PTT in SkuMgr Warning !  PTT/dTPM will be disabled and all data saved on it will be lost."
#string STR_PTT_STRING                          #language eng  "PTT"
#string STR_DTPM_STRING                         #language eng  "dTPM 1.2"

//---------------------------------------------------------------------------
// MEBx Configuration
//---------------------------------------------------------------------------
#string STR_MEBX_TYPE_PROMPT			#language eng  "MEBx Type"
#string STR_MEBX_TYPE_HELP			#language eng  "MEBx Type"
#string STR_MEBX_TYPE_NONE                      #language eng "None"
#string STR_MEBX_TYPE_MEBX                      #language eng "miniMEBx"

//---------------------------------------------------------------------------
// FW Update Configuration
//---------------------------------------------------------------------------
#string STR_FW_UPGRADE_FORM                     #language eng "Firmware Update Configuration"
#string STR_FW_UPGRADE_FORM_HELP                #language eng "Configure Management Engine Technology Parameters"
#string STR_AMT_ME_FW_DOWNGRADE_PROMPT          #language eng  "Me FW Image Re-Flash"
#string STR_AMT_ME_FW_DOWNGRADE_HELP            #language eng  "Enable/Disable Me FW Image Re-Flash function."
#string STR_AMT_LOCAL_FW_UPDATE_PROMPT          #language eng  "Local FW Update"
#string STR_AMT_LOCAL_FW_UPDATE_HELP            #language eng  "Enable/Disable Local FW Update function."
#string STR_AMT_LOCAL_FW_QUALIFIER_PROMPT       #language eng  "Local FW Qualifier"
#string STR_AMT_LOCAL_FW_QUALIFIER_HELP         #language eng  "Local FW Qualifier function."
#string STR_ALWAYS                              #language eng  "Always"
#string STR_NEVER                               #language eng  "Never"


//---------------------------------------------------------------------------
// OEM Configuration definitions
//---------------------------------------------------------------------------
#string STR_OEM_FORM                    #language eng "OEM Configuration"
#string STR_OEM_FORM_HELP               #language eng "Configure OEM Parameters"
#string STR_OEM_FORM_TITLE              #language eng "OEM Configuration"

//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************